BusinessProcesses/ПервичныйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<BusinessProcess>
		<Properties>
			<Name>ПервичныйДокумент</Name>
			<Task>Task.Заявка</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШагЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ШагЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоУдачноОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетУточнений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отказано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/ШагЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ШагЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
					<Comment>0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеВРаботу</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ПервичныйДокумент/Ext/ObjectModule.bsl
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ) 	
	ШагЗадачи = Перечисления.ШагЗадачи.ПринятиеВРаботу;
	ОповеститьСледующегоАдресата();
	Комментарий = ?( ЗначениеЗаполнено(Комментарий) И НЕ Стартован, "" + ПараметрыСеанса.ТекущийПользователь +
	"(" + Строка(ТекущаяДатаСеанса()) + ")  : " + Символы.ПС + Комментарий, "");
	Исполнитель  = ?(ЗначениеЗаполнено(Исполнитель) И НЕ Стартован, Константы.ПолучательПервичногоДокумента.Получить(), Исполнитель);		
КонецПроцедуры

Процедура ОповеститьСледующегоАдресата(текстЗаголовка = "") Экспорт
	
	Если НЕ ЭтотОбъект.ПолучательФИО.ОтключитьEmail Тогда
		массивПолучательEmail = Новый Массив;
		массивПолучательEmail.Добавить(ЭтотОбъект.ПолучательФИО.АдресЭлектроннойПочты);
		ОповеститьСледующегоАдресатаСогласоватьИлиВыполнить(массивПолучательEmail, "создана и направлена на рассмотрение");
	КонецЕсли;
		
КонецПроцедуры

Процедура ОповеститьСледующегоАдресатаСогласоватьИлиВыполнить(получательEmail, текстЗаголовка = "")
		
	отправительИмя = ЭтотОбъект.ЗаявительФИО.ПолноеИмя;
	// получательEmail - меняется
	тема = "задача от:" + отправительИмя + ", " +  " - " + текстЗаголовка;
		
	содержимоеТекст = "Отправитель: *ФИО , *Должность, *Подразделение " + Символы.ПС +
					  "Получатель: *ФИО , *Должность, *Подразделение "  + Символы.ПС +
					  "Тема обращения: *Тема "  + Символы.ПС +
					  "Номер заявки: "  + Строка(ЭтотОбъект.Номер) + Символы.ПС + Символы.ПС +
	
	ЭтотОбъект.Комментарий +
	Символы.ПС +
	Символы.ПС +

	"Дата " + Строка(ЭтотОбъект.Дата);
	
	// Сигнатура функции (только с обязательнами параметрами) которую необходимо выполнить в фоновом режиме	
	ТекстФоновойПроцедуры = "ОбщийМодульEmail.ОтправитьСодержимое(отправительИмя, массивАдресаПолучателей, тема, содержимоеТекст);";
	ФоновоеВыполнение.ЗапуститьФоновоеВыполнение(ТекстФоновойПроцедуры, 
	Новый Структура("отправительИмя, массивАдресаПолучателей, тема, содержимоеТекст",
	отправительИмя, получательEmail, тема, содержимоеТекст));
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если  НЕ пометкаУдаления И  (НЕ ЗначениеЗаполнено(ЭтотОбъект.ЗаявительФИО) И (НЕ ЭтотОбъект.Отказано)) Тогда
		Сообщить("Укажите ФИО заявителя!");
		Отказ = ИСТИНА;
		Возврат;
	КонецЕсли;		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования.ИмяЗадачи = "Копирование";
КонецПроцедуры

#Область НеИспользуется
// Не используется
Процедура СогласоватьРуководительИТПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	имяТекущейТочкиМаршрута = ТочкаМаршрутаБизнесПроцесса.ФункционалВТекущейИБ.ИмяПредопределенныхДанных;
	Если имяТекущейТочкиМаршрута <> "Инициатор" Тогда
		// Уведомление Куратора
		массивАдресов = УправлениеКонфигурацией.ПолучитМассивАдресовСледующихАресатов(имяТекущейТочкиМаршрута);
		ОповеститьСледующегоАдресатаСогласоватьИлиВыполнить(массивАдресов);		
	КонецЕсли;
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

Процедура ТребуетУточненийПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ТребуетУточнений;
КонецПроцедуры

Процедура ПеренаправилПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЗначениеЗаполнено(Исполнитель);
КонецПроцедуры

Процедура ОтказПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Отказано;
КонецПроцедуры

#КонецОбласти
